In [1]:
import numpy as np
import pandas as pd 
from pandas import DataFrame

In [2]:
dframe=DataFrame({'k1':['X','X','Y','Y','Z'],
                 'k2':['alpha','beta','alpha','beta','alpha'],
                 'dataset1':np.random.randn(5),
                 'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185
1  X   beta  1.384476  1.280756
2  Y  alpha  0.084405  0.934018
3  Y   beta -0.317855  0.957064
4  Z  alpha -1.309971 -0.650011

In [4]:
group1=dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -0.283186
Y   -0.116725
Z   -1.309971
Name: dataset1, dtype: float64

In [7]:
cities=np.array(['NY','LA','LA','NY','NY'])
month=np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185
1  X   beta  1.384476  1.280756
2  Y  alpha  0.084405  0.934018
3  Y   beta -0.317855  0.957064
4  Z  alpha -1.309971 -0.650011

In [9]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.384476
    JAN    0.084405
NY  FEB   -0.317855
    JAN   -1.630409
Name: dataset1, dtype: float64

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.283186  0.908971
Y  -0.116725  0.945541
Z  -1.309971 -0.650011

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.950848  0.537185
   beta   1.384476  1.280756
Y  alpha  0.084405  0.934018
   beta  -0.317855  0.957064
Z  alpha -1.309971 -0.650011

In [12]:
dataset2_group=dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.537185
   beta   1.280756
Y  alpha  0.934018
   beta   0.957064
Z  alpha -0.650011

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [20]:
for name,group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185
1  X   beta  1.384476  1.280756


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.084405  0.934018
3  Y   beta -0.317855  0.957064


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.309971 -0.650011

In [21]:
for (k1,k2),group in dframe.groupby(['k1','k2']):
    print('Key1={} Key2={}'.format(k1,k2))
    print(group)
    print('\n')

Key1=X Key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185


Key1=X Key2=beta
  k1    k2  dataset1  dataset2
1  X  beta  1.384476  1.280756


Key1=Y Key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.084405  0.934018


Key1=Y Key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.317855  0.957064


Key1=Z Key2=alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -1.309971 -0.650011

In [22]:
gr=dframe.groupby('k1')

In [23]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185
1  X   beta  1.384476  1.280756

In [24]:
group_dict=dict(list(dframe.groupby('k1')))

In [25]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -1.950848  0.537185
1  X   beta  1.384476  1.280756

In [ ]:
group_dict_axis1=dict(lis)